/*
 *----------------------------------------------------------------------
 *    T-Kernel Software Library
 *
 *    Copyright(c) 2016 by T.Yokobayashi.
 *----------------------------------------------------------------------
 */

/*
 *	@(#)cursor.c (libmisc) 2016/02/19
 *  cursor関係ﾗｲﾌﾞﾗﾘｰ
 */

#include <basic.h>
#include <misc/libmisc.h>



/*================================================
;|
;|□locate              《カーソルを移動する》
;|  ［形式］#include <misc/libmisc.h>
;|          void locate(int x, int y);
;|  ［引数］x…移動先のｘ座標(1～80)
;|          y…移動先のｙ座標(1～25)
;|  ［戻値］なし
;|  ［Note］・画面の左上の原点位置の座標は(1,1)となる。
;|          ・ｴｽｹｰﾌﾟｼｰｹﾝｽの [ESC]=<l><c> を利用。
;|
 ================================================*/
void locate(int x, int y)
{
	if (!x)
		x = 1;							/* x=0の時は1にする */
	if (!y)
		y = 1;							/* y=0の時は1にする */

	x += 0x1f;
	y += 0x1f;

	putch(ESC_CODE);
	putch('=');
	putch((char)y);
	putch((char)x);
}


/*================================================
;|
;|□cursor_off          《カーソルを表示しない》
;|  ［形式］#include <misc/libmisc.h>
;|          void cursor_off(void);
;|  ［引数］なし
;|  ［戻値］なし
;|  ［Note］・ｴｽｹｰﾌﾟｼｰｹﾝｽの [ESC][>5h を利用。
;|
 ================================================*/
void cursor_off(void)
{
	cputstring("\x1b[>5h");
}


/*================================================
;|
;|□cursor_on           《カーソルを表示する》
;|  ［形式］#include <misc/libmisc.h>
;|          void cursor_on(void);
;|  ［引数］なし
;|  ［戻値］なし
;|  ［Note］・ｴｽｹｰﾌﾟｼｰｹﾝｽの [ESC][>5l を利用。
;|
 ================================================*/
void cursor_on(void)
{
	cputstring("\x1b[>5l");
}


/*================================================
;|
;|□cls                 《画面をクリアする》
;|  ［形式］#include <misc/libmisc.h>
;|          void cls(void);
;|  ［引数］なし
;|  ［戻値］なし
;|  ［Note］・
;|
 ================================================*/
void cls(void)
{
	putch(CLS_CODE);
}


/*----------------------------------------------------------------------
#|History of "cursor.c"
#|=====================
#|* 2016/02/11	新規作成(by T.Yokobayashi)
#|  "sh_std/lib/cursor.c"を流用
#|
*/
