/*
 *----------------------------------------------------------------------
 *
 *    T-Kernel Software Library
 *
 *----------------------------------------------------------------------
 */

/*
 *	@(#)init_librpi.c (librpi) 2016/11/22
 *  librpi初期化ﾗｲﾌﾞﾗﾘｰ
 */

#include <basic.h>
#include <misc/librpi.h>



/*================================================
;|
;|□init_librpi         《librpiライブラリーの初期化》
;|  ［形式］#include <misc/librpi.h>
;|          int init_libmisc(void);
;|  ［引数］なし
;|  ［戻値］=0:正常終了
;|  ［Note］・librpiライブラリーを利用する前に、本ルーチンをコールしておく。
;|
 ================================================*/
int init_librpi(void)
{
	return 0;
}


/*----------------------------------------------------------------------
#|History of "init_librpi.c"
#|==========================
#|* 2016/11/22	New created.(By T.Yokobayashi)
#|
*/
